{"keras_version": "2.2.2", "config": [{"config": {"name": "conv2d_3", "dtype": "float32", "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 32, 32, 3], "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}